Revit 2027 API
PropertyTableEntry.CurveType Property
 The curve type for this PropertyTableEntry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PropertyTableEntryCurveType CurveType { get; }
Public ReadOnly Property CurveType As PropertyTableEntryCurveType
	Get
public:
property PropertyTableEntryCurveType CurveType {
	PropertyTableEntryCurveType get ();
}
member CurveType : PropertyTableEntryCurveType with get
Property Value
PropertyTableEntryCurveType
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace